## Plan Result (prod-uksouth-enterprise)




<pre><code>Plan: 190 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;Security&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.module.bootstrap.azuread_group.contributors["CFT"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:CFT)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["CFT-NonProd"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:CFT-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["CFT-Prod"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:CFT-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["CFT-Sandbox"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:CFT-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Crime"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Crime)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["HMCTS"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Heritage"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Heritage)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Heritage-NonProd"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Heritage-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Heritage-Prod"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Heritage-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Heritage-Sandbox"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Heritage-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Platform"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Platform)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Platform-NonProd"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Platform-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Platform-Prod"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Platform-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["Platform-Sandbox"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:Platform-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["SDS"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members  

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

wn after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["SDS"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["Security"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["CFT"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Crime"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["HMCTS"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Heritage"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Platform"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["SDS"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["Security"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 190 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"","Target":"prod-uksouth-enterprise","Vars":{}} -->